app/views/apps/texty/verify.html.erb

INSERT INTO "phones" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2016-04-18 19:39:39.174012"], ["updated_at", "2016-04-18 19:39:39.174012"]]
---

 <h1><span class="yellow-word" style="color:#fdb814"><</span> Thanks! Your code has been sent to <%= @phone.number %> <span style="color:#fdb814">/></span> </h1>