app/controllers/apps/api_controller.rb

    def index
    @phone = Phone.last
---
SELECT  "phones".* FROM "phones"  ORDER BY "phones"."id" DESC LIMIT 1