app/controllers/apps/texty_controller.rb

SELECT  1 AS one FROM "users" LIMIT 1
---
  def index
    # @phone = Phone.new

    @phone = Phone.new


    # uri = "#{API_BASE_URL}.json?pages=10" # specifying json format in the URl
    # rest_resource = RestClient::Resource.new(uri, USERNAME, PASSWORD)
    # users = rest_resource.get
    # @users = JSON.parse(users, :symbolize_names => true) # we will convert the return
    if User.exists? params[:user_id].to_i

SELECT  "phones".* FROM "phones"  ORDER BY "phones"."id" DESC LIMIT 1
---
  def verify

    @phone = Phone.last

SELECT  "phones".* FROM "phones"  ORDER BY "phones"."id" DESC LIMIT 1
SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 1
---
  def update

    @phone = Phone.last
    @user = User.last