app/controllers/apps/texty_controller.rb

  def index
    # @phone = Phone.new

    @phone = Phone.new


    # uri = "#{API_BASE_URL}.json?pages=10" # specifying json format in the URl
    # rest_resource = RestClient::Resource.new(uri, USERNAME, PASSWORD)
    # users = rest_resource.get
    # @users = JSON.parse(users, :symbolize_names => true) # we will convert the return

            @user = User.new
            if @user.id?
              @user = User.last

              redirect_to "/apps/texty/verify"
            elsif !@user.id?

            @user.id = params[:user_id]
            session[:user] = params[:user_id]
            @phone.user_id = params[:user_id]
            @user.save
---
INSERT INTO "users" ("id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["id", 17774629], ["created_at", "2016-05-03 20:11:21.343623"], ["updated_at", "2016-05-03 20:11:21.343623"]]


            @phone.number = @user[:custom][:telephone]

            if !Phone.exists?(@phone.vercode)
            @phone.vercode = rand(10000..100000).to_s
            @phone.save
---
SELECT  "phones".* FROM "phones" WHERE "phones"."user_id" IS NULL LIMIT 1
INSERT INTO "phones" ("number", "vercode", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["number", "3123913609"], ["vercode", "47278"], ["created_at", "2016-05-03 20:50:19.701910"], ["updated_at", "2016-05-03 20:50:19.701910"]]
UPDATE "phones" SET "vercode" = $1, "updated_at" = $2 WHERE "phones"."id" = $3  [["vercode", "64218"], ["updated_at", "2016-05-03 02:55:45.098241"], ["id", 99]]

def update_phone
    @phone = Phone.find_by_user_id(session[:user])
    @user = User.find_by_id(session[:user])
    @phone.vercode = rand(10000..100000).to_s
    @phone.update(:number => params[:phone][:number])
---
SELECT  "phones".* FROM "phones" WHERE "phones"."user_id" IS NULL LIMIT 1
UPDATE "phones" SET "number" = $1, "updated_at" = $2 WHERE "phones"."id" = $3  [["number", "2222222"], ["updated_at", "2016-05-10 22:55:29.427151"], ["id", 1]]

  def send_text
    @phone = Phone.find_by_user_id(session[:user])
    @user = User.find_by_id(session[:user])
    @phone.send_sms(@phone.number,@phone.vercode)
    @phone.save
---
UPDATE "phones" SET "vercode" = $1, "updated_at" = $2 WHERE "phones"."id" = $3  [["vercode", "23268"], ["updated_at", "2016-05-03 00:14:11.121866"], ["id", 92]]

  def forgot

    session[:user] = params[:user_id]


    @phone = Phone.find_by_user_id(session[:user])
---
SELECT  "phones".* FROM "phones" WHERE "phones"."user_id" IS NULL LIMIT 1

  def verify

 @phone = Phone.find_by_user_id(session[:user])
    @user = User.find_by_id(session[:user])
---
SELECT  "phones".* FROM "phones" WHERE "phones"."user_id" IS NULL LIMIT 1
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

  def authcallback
    @phone = Phone.last
---
SELECT  "phones".* FROM "phones"  ORDER BY "phones"."id" DESC LIMIT 1