app/controllers/users_controller.rb

SELECT  "phones".* FROM "phones"  ORDER BY "phones"."id" DESC LIMIT 1
SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 1
INSERT INTO "users" ("id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["id", 17414384], ["created_at", "2016-04-22 19:54:09.055065"], ["updated_at", "2016-04-22 19:54:09.055065"]]
---
    def index
      @phone = Phone.last
      @user = User.new
      uri = "#{API_BASE_URL}/users.json" # specifying json format in the URl
      rest_resource = RestClient::Resource.new(uri, USERNAME, PASSWORD) # create new rest-client resource to call methods on it
      users = rest_resource.get # will get back you all the detail in json format, but it will we wraped as string, so we will parse it in the next step.
      @users = JSON.parse(users, :symbolize_names => true) # we will convert the return
      @user.id = @users[-1][:id]
      if !User.exists?(@user.id)
      @user.save